---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ChangeSpotElevationFailed
source: html/6cd61cf9-2a3e-6da1-6708-4c9630e53b41.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ChangeSpotElevationFailed Property

Can't change Spot Elevation to the desired value.

## Syntax (C#)
```csharp
public static FailureDefinitionId ChangeSpotElevationFailed { get; }
```